---
kind: method
id: M:Autodesk.Revit.DB.ConnectionValidationInfo.IsValidWarningIndex(System.Int32)
source: html/8c6fdd17-4831-17f9-e226-fb065758c7c3.htm
---
# Autodesk.Revit.DB.ConnectionValidationInfo.IsValidWarningIndex Method

Validate warning index.

## Syntax (C#)
```csharp
public bool IsValidWarningIndex(
	int index
)
```

## Parameters
- **index** (`System.Int32`)